eseungho/OpenEPaperLink/ESP32_AP-Flasher/src/ble_filter.cpp
#ifdef HAS_BLE_WRITER
#include <Arduino.h>
#include <FS.h>

#include "BLEDevice.h"
#include "newproto.h"
#include "serialap.h"
#include "settings.h"
#include "storage.h"
#include "system.h"
#include "tag_db.h"
#include "tagdata.h"
#include "udp.h"
#include "util.h"
#include "web.h"

uint8_t* Mirrorbuffer;

uint8_t gicToOEPLtype(uint8_t gicType) {
    switch (gicType) {
        case 0xA0:
            return GICI_BLE_TFT_21_BW;
            break;
        case 0x08:
            return GICI_BLE_EPD_21_BW;
            break;
        case 0x0B:
            return GICI_BLE_EPD_21_BWR;
            break;
        case 0x28:
        case 0x30:
            return GICI_BLE_EPD_29_BW;
            break;
        case 0x2B:
            return GICI_BLE_EPD_29_BWR;
            break;
        case 0x33:
            return GICI_BLE_EPD_29_BWR1;
            break;
        case 0x2E:
            return GICI_BLE_EPD_29_BWRY;
            break;
        case 0x48:
            return GICI_BLE_EPD_BW_42;
            break;
        case 0x4B:
            return GICI_BLE_EPD_BWR_42;
            break;
        case 0x40:
            return GICI_BLE_TFT_BW_42;
            break;
        case 0x42:
            return GICI_BLE_TFT_BWR_42;
            break;
        case 0x68:
            return GICI_BLE_EPD_BW_74;
            break;
        case 0x6A:
            return GICI_BLE_EPD_BWR_74;
            break;
        case 0xEB:
            return GICI_BLE_EPD_BWR_29_SILABS;
            break;
        default:
            return GICI_BLE_UNKNOWN;
            break;
    }
}

uint8_t wolinkToOEPLtype(uint16_t modelId, uint16_t hwVersion) {
    // pid 0x000E is reused by multiple physical sizes; distinguish via the
    // hw_version field at manuData[8..9] (BE) instead of pid alone:
    //   0x0103 -> 2.13" 250x128 BWRY (e.g. WL17117F6A)
    //   0x0201 -> 3.5"  384x184 BWRY (e.g. WL17402773)
    // Anything else with the Wolink/Zhsunyco header (manuf id 0xAABB) but an
    // unknown (modelId, hwVersion) is reported as WOLINK_BLE_UNKNOWN so the
    // dashboard surfaces the tag without our BLE writer trying to push the
    // wrong-size buffer to it.
    if (modelId == 0x000E) {
        if (hwVersion == 0x0103) return WOLINK_BLE_EPD_213_BWRY;
        if (hwVersion == 0x0201) return WOLINK_BLE_EPD_350_BWRY;
    }
    return WOLINK_BLE_UNKNOWN;
}

struct BleAdvDataStructV1 {
    uint16_t manu_id;  // 0x1337 for us
    uint8_t version;
    uint16_t hw_type;
    uint16_t fw_version;
    uint16_t capabilities;
    uint16_t battery_mv;
    uint8_t counter;
} __packed;
struct BleAdvDataStructV2 {
    uint16_t manu_id;  // 0x1337 for us
    uint8_t version;
    uint16_t hw_type;
    uint16_t fw_version;
    uint16_t capabilities;
    uint16_t battery_mv;
    int8_t temperature;
    uint8_t counter;
} __packed;

bool BLE_filter_add_device(BLEAdvertisedDevice advertisedDevice) {
    Serial.print("BLE Advertised Device found: ");
    Serial.println(advertisedDevice.toString().c_str());

    uint8_t payloadData[100];
    int payloadDatalen = advertisedDevice.getPayloadLength();
    memcpy(&payloadData, (uint8_t*)advertisedDevice.getPayload(), payloadDatalen);
    Serial.printf(" Payload data: ");
    for (int i = 0; i < payloadDatalen; i++)
        Serial.printf("%02X", payloadData[i]);
    Serial.printf("\r\n");

    if (advertisedDevice.haveManufacturerData()) {
        int manuDatalen = advertisedDevice.getManufacturerData().length();
        uint8_t manuData[100];
        if (manuDatalen > sizeof(manuData))
            return false;  // Manu data too big, could never happen but better make sure here
#if ESP_ARDUINO_VERSION_MAJOR == 2
        memcpy(&manuData, (uint8_t*)advertisedDevice.getManufacturerData().data(), manuDatalen);
#else
        // [Nic] suggested fix for arduino 3.x by copilot, but I cannot test it
        memcpy(&manuData, (uint8_t*)advertisedDevice.getManufacturerData().c_str(), manuDatalen);
#endif
        Serial.printf(" Address type: %02X Manu data: ", advertisedDevice.getAddressType());
        for (int i = 0; i < advertisedDevice.getManufacturerData().length(); i++)
            Serial.printf("%02X", manuData[i]);
        Serial.printf("\r\n");
        if (manuDatalen == 7 && manuData[0] == 0x53 && manuData[1] == 0x50) {  // Lets check for a Gicisky E-Paper display

            struct espAvailDataReq theAdvData;
            memset((uint8_t*)&theAdvData, 0x00, sizeof(espAvailDataReq));

            uint8_t macReversed[6];
            memcpy(&macReversed, (uint8_t*)advertisedDevice.getAddress().getNative(), 6);
            theAdvData.src[0] = macReversed[5];
            theAdvData.src[1] = macReversed[4];
            theAdvData.src[2] = macReversed[3];
            theAdvData.src[3] = macReversed[2];
            theAdvData.src[4] = macReversed[1];
            theAdvData.src[5] = macReversed[0];
            theAdvData.src[6] = manuData[2];  // We use this do find out what type of display we got for compression^^
            theAdvData.src[7] = manuData[6];
            theAdvData.adr.batteryMv = manuData[3] * 100;
            theAdvData.adr.lastPacketRSSI = advertisedDevice.getRSSI();
            theAdvData.adr.lastPacketLQI = advertisedDevice.getRSSI();
            theAdvData.adr.hwType = gicToOEPLtype(manuData[2]);
            theAdvData.adr.tagSoftwareVersion = manuData[4] << 8 | manuData[5];
            theAdvData.adr.capabilities = 0x00;

            processDataReq(&theAdvData, true);
            return true;
        } else if (manuDatalen >= 3 && manuData[0] == 0x37 && manuData[1] == 0x13) {  // Lets check for a Gicisky E-Paper display
            Serial.printf("ATC BLE OEPL Detected\r\n");
            struct espAvailDataReq theAdvData;
            memset((uint8_t*)&theAdvData, 0x00, sizeof(espAvailDataReq));
            uint8_t versionAdvData = manuData[2];

            switch (versionAdvData) {
                case 1: {
                    if (manuDatalen >= sizeof(BleAdvDataStructV1)) {
                        struct BleAdvDataStructV1 inAdvData;
                        memcpy(&inAdvData, manuData, sizeof(BleAdvDataStructV1));
                        printf("Version 1 ATC_BLE_OEPL Received\r\n");
                        /*Serial.printf("manu_id %04X\r\n", inAdvData.manu_id);
                        Serial.printf("version %02X\r\n", inAdvData.version);
                        Serial.printf("hw_type %04X\r\n", inAdvData.hw_type);
                        Serial.printf("fw_version %04X\r\n", inAdvData.fw_version);
                        Serial.printf("capabilities %04X\r\n", inAdvData.capabilities);
                        Serial.printf("battery_mv %u\r\n", inAdvData.battery_mv);
                        Serial.printf("counter %u\r\n", inAdvData.counter);*/
                        theAdvData.adr.batteryMv = inAdvData.battery_mv;
                        theAdvData.adr.lastPacketRSSI = advertisedDevice.getRSSI();
                        theAdvData.adr.hwType = inAdvData.hw_type & 0xff;
                        theAdvData.adr.tagSoftwareVersion = inAdvData.fw_version;
                        theAdvData.adr.capabilities = inAdvData.capabilities & 0xff;
                    } else {
                        printf("Version 1 data length incorrect!\r\n");
                        return false;
                    }
                } break;
                case 2: {
                    if (manuDatalen >= sizeof(BleAdvDataStructV2)) {
                        struct BleAdvDataStructV2 inAdvData;
                        memcpy(&inAdvData, manuData, sizeof(BleAdvDataStructV2));
                        printf("Version 2 ATC_BLE_OEPL Received\r\n");
                        /*Serial.printf("manu_id %04X\r\n", inAdvData.manu_id);
                        Serial.printf("version %02X\r\n", inAdvData.version);
                        Serial.printf("hw_type %04X\r\n", inAdvData.hw_type);
                        Serial.printf("fw_version %04X\r\n", inAdvData.fw_version);
                        Serial.printf("capabilities %04X\r\n", inAdvData.capabilities);
                        Serial.printf("battery_mv %u\r\n", inAdvData.battery_mv);
                        Serial.printf("temperature %i\r\n", inAdvData.temperature);
                        Serial.printf("counter %u\r\n", inAdvData.counter);*/
                        theAdvData.adr.batteryMv = inAdvData.battery_mv;
                        theAdvData.adr.temperature = inAdvData.temperature;
                        theAdvData.adr.lastPacketRSSI = advertisedDevice.getRSSI();
                        theAdvData.adr.hwType = inAdvData.hw_type & 0xff;
                        theAdvData.adr.tagSoftwareVersion = inAdvData.fw_version;
                        theAdvData.adr.capabilities = inAdvData.capabilities & 0xff;
                    } else {
                        printf("Version 2 data length incorrect!\r\n");
                        return false;
                    }
                } break;
                default:
                    printf("Version %02X currently not supported!\r\n", versionAdvData);
                    return false;
                    break;
            }
            uint8_t macReversed[6];
            memcpy(&macReversed, (uint8_t*)advertisedDevice.getAddress().getNative(), 6);
            theAdvData.src[0] = macReversed[5];
            theAdvData.src[1] = macReversed[4];
            theAdvData.src[2] = macReversed[3];
            theAdvData.src[3] = macReversed[2];
            theAdvData.src[4] = macReversed[1];
            theAdvData.src[5] = macReversed[0];
            theAdvData.src[6] = manuData[0];  // We use this do find out what type of display we got for compression^^
            theAdvData.src[7] = manuData[1];
            processDataReq(&theAdvData, true);
            return true;
        }
        Serial.printf(" Wolink check: len=%d head=%02X%02X (need len>=12 head=AABB)\r\n",
                      manuDatalen, manuData[0], manuData[1]);
        if (manuDatalen >= 12 && manuData[0] == 0xAA && manuData[1] == 0xBB) {
            // Wolink/Zhsunyco BLE ESL. Raw manuf data starts with company id
            // bytes AA BB (i.e. 0xBBAA in BLE LE encoding); some scanners and
            // the user's original capture report it as 0xAABB byte-swapped.
            // Wire layout for the first 12 bytes (the 10 B payload after the
            // company id is also re-broadcast a second time so total length
            // is typically 22):
            //   [0..1]   company id raw bytes AA BB
            //   [2..3]   flags
            //   [4..5]   model/PID, big-endian (0x000E = 2.13" BWRY)
            //   [6..7]   app version (big-endian)
            //   [8..9]   hw version (big-endian)
            //   [10..11] battery mV, big-endian
            // Reference: NickWaterton/Wolink wolink_ble.py decode_data()/decode_battery().
            Serial.printf("Wolink/Zhsunyco BLE ESL detected\r\n");
            uint16_t modelId = (manuData[4] << 8) | manuData[5];
            uint16_t hwVersion = (manuData[8] << 8) | manuData[9];
            uint16_t battMv = (manuData[10] << 8) | manuData[11];
            uint8_t hwType = wolinkToOEPLtype(modelId, hwVersion);
            Serial.printf("Wolink modelId 0x%04X hw 0x%04X battery %u mV hwType 0x%02X\r\n",
                          modelId, hwVersion, battMv, hwType);

            struct espAvailDataReq theAdvData;
            memset((uint8_t*)&theAdvData, 0x00, sizeof(espAvailDataReq));
            uint8_t macReversed[6];
            memcpy(&macReversed, (uint8_t*)advertisedDevice.getAddress().getNative(), 6);
            theAdvData.src[0] = macReversed[5];
            theAdvData.src[1] = macReversed[4];
            theAdvData.src[2] = macReversed[3];
            theAdvData.src[3] = macReversed[2];
            theAdvData.src[4] = macReversed[1];
            theAdvData.src[5] = macReversed[0];
            theAdvData.src[6] = manuData[4];  // model byte (BE high)
            theAdvData.src[7] = manuData[5];  // model byte (BE low)
            theAdvData.adr.batteryMv = battMv;
            theAdvData.adr.lastPacketRSSI = advertisedDevice.getRSSI();
            theAdvData.adr.lastPacketLQI = advertisedDevice.getRSSI();
            theAdvData.adr.hwType = hwType;
            theAdvData.adr.tagSoftwareVersion = (manuData[6] << 8) | manuData[7];
            theAdvData.adr.capabilities = 0x00;
            processDataReq(&theAdvData, true);
            return true;
        }
#ifdef HAS_NEMONIC_PRINTER
        if (manuDatalen >= 2 && manuData[0] == 0x74 && manuData[1] == 0xF0) {
            // Nemonic MIP-201 BLE thermal label printer.
            // Company id 0xF074 (raw LE bytes 74 F0). Sample mfr data:
            //   74 F0 7D 57 D0 DC 30 31    (per nRF Scanner trace)
            //          \________________/
            //           model / serial — not parsed in v1
            // Device name observed: "nemonic_W" (SDK also lists "MIP-201").
            Serial.printf("Nemonic BLE printer detected (mfr data %d bytes)\r\n", manuDatalen);

            struct espAvailDataReq theAdvData;
            memset((uint8_t*)&theAdvData, 0x00, sizeof(espAvailDataReq));
            uint8_t macReversed[6];
            memcpy(&macReversed, (uint8_t*)advertisedDevice.getAddress().getNative(), 6);
            theAdvData.src[0] = macReversed[5];
            theAdvData.src[1] = macReversed[4];
            theAdvData.src[2] = macReversed[3];
            theAdvData.src[3] = macReversed[2];
            theAdvData.src[4] = macReversed[1];
            theAdvData.src[5] = macReversed[0];
            theAdvData.src[6] = 0x00;  // dispatch is via hwType, not last-MAC bytes
            theAdvData.src[7] = 0x00;
            theAdvData.adr.lastPacketRSSI = advertisedDevice.getRSSI();
            theAdvData.adr.lastPacketLQI  = advertisedDevice.getRSSI();
            theAdvData.adr.hwType = NEMONIC_BLE_MIP201;  // 0xE6
            theAdvData.adr.tagSoftwareVersion = 0;
            theAdvData.adr.capabilities = 0x00;  // matches Wolink/Gicisky convention (8-bit field)
            theAdvData.adr.batteryMv = 0;  // not in advertisement; query via 1C 76 31 later if needed
            processDataReq(&theAdvData, true);
            return true;
        }
#endif
    }
    if (payloadDatalen >= 17) {  // Lets check for an ATC Mi Thermometer
        uint8_t macReversed[6];
        memcpy(&macReversed, (uint8_t*)advertisedDevice.getAddress().getNative(), 6);
        if (payloadData[9] == macReversed[5] && payloadData[8] == macReversed[4] && payloadData[7] == macReversed[3]) {  // Here we found an ATC Mi Thermometer
            struct espAvailDataReq theAdvData;
            memset((uint8_t*)&theAdvData, 0x00, sizeof(espAvailDataReq));

            theAdvData.src[0] = macReversed[5];
            theAdvData.src[1] = macReversed[4];
            theAdvData.src[2] = macReversed[3];
            theAdvData.src[3] = macReversed[2];
            theAdvData.src[4] = macReversed[1];
            theAdvData.src[5] = macReversed[0];
            theAdvData.src[6] = 0x00;
            theAdvData.src[7] = 0x00;
            theAdvData.adr.batteryMv = payloadData[14] << 8 | payloadData[15];
            theAdvData.adr.temperature = (payloadData[10] << 8 | payloadData[11]) / 10;
            theAdvData.adr.lastPacketLQI = payloadData[12];
            theAdvData.adr.lastPacketRSSI = advertisedDevice.getRSSI();
            theAdvData.adr.hwType = ATC_MI_THERMOMETER;
            theAdvData.adr.tagSoftwareVersion = 0x00;
            theAdvData.adr.capabilities = 0x00;
            processDataReq(&theAdvData, true);
            Serial.printf("We got an ATC_MiThermometer via BLE\r\n");
            return true;
        }
    }
    return false;
}

bool BLE_is_image_pending(uint8_t address[8]) {
    for (int16_t c = 0; c < tagDB.size(); c++) {
        tagRecord* taginfo = tagDB.at(c);
        if (taginfo->pendingCount > 0 && taginfo->version == 0 &&
            (((taginfo->hwType & 0xF0) == 0xB0) ||
             (taginfo->hwType == WOLINK_BLE_EPD_213_BWRY) ||
             (taginfo->hwType == WOLINK_BLE_EPD_350_BWRY)
#ifdef HAS_NEMONIC_PRINTER
             || (taginfo->hwType == 0xE6)
#endif
             )) {
            memcpy(address, taginfo->mac, 8);
            return true;
        }
    }
    for (int16_t c = 0; c < tagDB.size(); c++) {
        tagRecord* taginfo = tagDB.at(c);
        if (taginfo->pendingCount > 0 && taginfo->version == 0 && (taginfo->mac[7] == 0x13) && (taginfo->mac[6] == 0x37)) {
            memcpy(address, taginfo->mac, 8);
            Serial.printf("ATC BLE OEPL data Waiting\r\n");
            return true;
        }
    }
    return false;
}

