eseungho/OpenEPaperLink/ESP32_AP-Flasher/src/ble_filter.cpp
    tagRecord* taginfo = tagRecord::findByMAC(address);
    uint8_t hwType = (taginfo != nullptr) ? taginfo->hwType : 0;
    uint16_t width = 0, height = 0;
    switch (hwType) {
        case WOLINK_BLE_EPD_213_BWRY:
            width = 250;
            height = 128;
            break;
        case WOLINK_BLE_EPD_350_BWRY:
            width = 384;
            height = 184;
            break;
        default:
            Serial.printf("Wolink pack: unsupported hwType 0x%02X, canceling\r\n", hwType);
            prepareCancelPending(address);
            return 0;
    }
    const uint32_t byte_per_line = (uint32_t)height / 8;
    const uint32_t plane_size = (uint32_t)width * byte_per_line;
    const uint32_t out_len = (uint32_t)width * ((uint32_t)height / 4);

    if (out_len > max_len) {
        Serial.printf("Wolink pack: buffer too small (%u < %u)\r\n",
                      (unsigned)max_len, (unsigned)out_len);
        return 0;
    }
    if (queueItem->len < 2 * plane_size) {
        Serial.printf("Wolink pack: source too small (%u < %u)\r\n",
                      (unsigned)queueItem->len, (unsigned)(2 * plane_size));
        return 0;
    }

    memset(buffer, 0, out_len);
    for (int x = 0; x < width; x++) {
        int phy_x = (width - 1) - x;                  // Wolink RAM is x-flipped too
        for (int y = 0; y < height; y++) {
            uint32_t off = (uint32_t)x * byte_per_line + (y / 8);
            uint8_t mask = 0x80 >> (y % 8);
            uint8_t p1 = (queueItem->data[off] & mask) ? 1 : 0;                 // B/W plane
            uint8_t p2 = (queueItem->data[off + plane_size] & mask) ? 1 : 0;    // color plane
            // Match the Phase 1 (GICisky BWRY) mapping: hi=p2, lo=~p1.
            // black (1,0)->00, white (0,0)->01, red (0,1)->11, yellow (1,1)->10.
            uint8_t color = ((uint8_t)(p2 & 1) << 1) | (uint8_t)(p1 ? 0 : 1);
            int phy_y = (height - 1) - y;                  // Wolink RAM is y-flipped
            uint32_t out_byte = (uint32_t)phy_x * (height / 4) + (phy_y / 4);
            int out_shift = 6 - (phy_y % 4) * 2;           // MSB-first within byte
            buffer[out_byte] |= color << out_shift;
        }
    }
    return out_len;
}

uint32_t get_ATC_BLE_OEPL_image(uint8_t address[8], uint8_t* buffer, uint32_t max_len, uint8_t* dataType, uint8_t* dataTypeArgument, uint16_t* nextCheckIn) {
    uint32_t t = millis();
    PendingItem* queueItem = getQueueItem(address, 0);
    if (queueItem == nullptr) {
        prepareCancelPending(address);
        Serial.printf("blockrequest: couldn't find taginfo %02X%02X%02X%02X%02X%02X%02X%02X\r\n", address[7], address[6], address[5], address[4], address[3], address[2], address[1], address[0]);
        return 0;
    }
    if (queueItem->data == nullptr) {
        fs::File file = contentFS->open(queueItem->filename);
        if (!file) {
            Serial.print("No current file. " + String(queueItem->filename) + " Canceling request\r\n");
            prepareCancelPending(address);
            return 0;
        }
        queueItem->data = getDataForFile(file);
        Serial.println("Reading file " + String(queueItem->filename) + " in  " + String(millis() - t) + "ms");
        file.close();
    }
    if (queueItem->len > max_len) {
        Serial.print("The upload is too big better cencel it\r\n");
        prepareCancelPending(address);
        return 0;
    }
    *dataType = queueItem->pendingdata.availdatainfo.dataType;
    *dataTypeArgument = queueItem->pendingdata.availdatainfo.dataTypeArgument;
    *nextCheckIn = queueItem->pendingdata.availdatainfo.nextCheckIn;
    uint32_t len_compressed = queueItem->len;
    memcpy(buffer, queueItem->data, queueItem->len);
    Serial.print("Data is prepared Len: " + String(queueItem->len) + "\r\n");
    return queueItem->len;
}

#endif
